app/Console/Commands/ImportAppCsv.php

insert into `app_items` (`item_code`, `fiscal_year`, `category`, `item_name`, `unit_of_measure`, `unit_price`, `specifications`, `is_active`, `updated_at`, `created_at`) values ('12191601-AL-E04', '2026', 'ALCOHOL OR ACETONE BASED ANTISEPTICS', 'ALCOHOL, Ethyl, 500 mL', 'bottle', 50.43, 'ALCOHOL, Ethyl, 500 mL', 1, '2026-01-16 08:54:34', '2026-01-16 08:54:34')
select * from `app_items` where (`item_code` = '12191601-AL-E04' and `fiscal_year` = '2026') limit 1
---
                    }

                    // Create or update the APP item
                    $appItem = AppItem::updateOrCreate(
                        [
                            'item_code' => $itemCode,
                            'fiscal_year' => $fiscalYear,
                        ],
                        [
                            'category' => $currentCategory,
                            'item_name' => $itemName,
                            'unit_of_measure' => $unitOfMeasure,
                            'unit_price' => $price,
                            'specifications' => $itemName, // Use item name as specification for now
                            'is_active' => true,
                        ]
                    );