app/Services/AoqService.php

    public function calculateWinnersAndTies(PurchaseRequest $purchaseRequest, ?PrItemGroup $itemGroup = null): array
    {
        $results = [];

        // Determine which items to process (lot headers + standalones; exclude lot children)
        if ($itemGroup) {
            $items = $itemGroup->items->filter(fn ($i) => ! $i->isLotChild())->values();
            $quotations = $itemGroup->quotations()
                ->with(['supplier', 'quotationItems.purchaseRequestItem'])
                ->get();
        } else {
            $items = $purchaseRequest->items->filter(fn ($i) => ! $i->isLotChild())->values();
            $quotations = $purchaseRequest->quotations()
                ->with(['supplier', 'quotationItems.purchaseRequestItem'])
                ->get();
        }

        // Group quotation items by purchase request item
        foreach ($items as $prItem) {
            $itemQuotes = [];
            $allQuotes = []; // Include all quotes for display (including disqualified/withdrawn)

            // Collect all quotes for this item
            foreach ($quotations as $quotation) {
                $quoteItem = $quotation->quotationItems()
                    ->where('purchase_request_item_id', $prItem->id)
                    ->first();
---
select * from `purchase_request_items` where `purchase_request_items`.`id` in (12, 13)
select * from `quotation_items` where `quotation_items`.`quotation_id` in (10, 12, 17)
select * from `suppliers` where `suppliers`.`id` in (1, 4, 7)
select * from `quotation_items` where `id` in (14, 13)

    public function canGenerateAoqForGroup(PrItemGroup $itemGroup): array
    {
        $errors = [];
        $purchaseRequest = $itemGroup->purchaseRequest;

        // Must be in a state that allows AOQ generation for this specific group
        // (first-time generation or regeneration when no PO exists yet)
        if (! $itemGroup->canCreateAoq() && ! $itemGroup->canRegenerateAoq()) {
            $errors[] = 'This group already has an AOQ or Purchase Order created.';
        }

        // Check if there are quotations for this group
        $quotationsCount = $itemGroup->quotations()->count();
        if ($quotationsCount === 0) {
            $errors[] = 'No quotations have been submitted for this group yet.';
        }

        // Check each quotable item in the group (excluding lot children)
        foreach ($itemGroup->items as $item) {
            if ($item->isLotChild() || $item->procurement_status === 'failed') {
                continue;
            }

            $hasQuote = QuotationItem::where('purchase_request_item_id', $item->id)
                ->whereNotNull('unit_price')
                ->where('is_withdrawn', false)
                ->exists();
---
select exists(select * from `quotation_items` where `purchase_request_item_id` = 12 and `unit_price` is not null and `is_withdrawn` = 0) as `exists`

                continue;
            }

            $tiedItems = QuotationItem::where('purchase_request_item_id', $item->id)
                ->where('is_tied', true)
                ->where('is_winner', false)
                ->where('is_withdrawn', false)
                ->count();

            if ($tiedItems > 0) {
                $decision = AoqItemDecision::where('purchase_request_item_id', $item->id)
                    ->where('is_active', true)
                    ->exists();
---
select count(*) as aggregate from `quotation_items` where `purchase_request_item_id` = 12 and `is_tied` = 1 and `is_winner` = 0 and `is_withdrawn` = 0
select exists(select * from `aoq_item_decisions` where `purchase_request_item_id` = 12 and `is_active` = 1) as `exists`