app/Services/PurchaseRequestActivityLogger.php

insert into `purchase_request_activities` (`purchase_request_id`, `user_id`, `action`, `old_value`, `new_value`, `description`, `ip_address`, `user_agent`, `created_at`) values (2, 20, 'created', null, null, 'Purchase request created', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/143.0.0.0 Safari/537.36', '2026-01-16 10:43:15')
---
    public function log(PurchaseRequest $purchaseRequest, array $data): PurchaseRequestActivity
    {
        return PurchaseRequestActivity::create([
            'purchase_request_id' => $purchaseRequest->id,
            'user_id' => $data['user_id'] ?? null,
            'action' => $data['action'],
            'old_value' => $data['old_value'] ?? null,
            'new_value' => $data['new_value'] ?? null,
            'description' => $data['description'],
            'ip_address' => Request::ip(),
            'user_agent' => Request::userAgent(),
            'created_at' => now(),
        ]);