app/Http/Requests/StoreReplacementPurchaseRequestRequest.php

select * from `app_items` where `app_items`.`id` in (2)
select * from `ppmp_items` where `ppmp_items`.`id` = '1' limit 1
select * from `ppmps` where `ppmps`.`id` in (2)
---
    protected function validatePpmpItemQuarter($ppmpItemId, string $attribute, $fail): void
    {
        $ppmpItem = PpmpItem::with(['ppmp', 'appItem'])->find($ppmpItemId);

select * from `app_items` where `app_items`.`id` in (2)
select * from `ppmp_items` where `ppmp_items`.`id` = '1' limit 1
---
    protected function validateQuantityAgainstPpmpQuarter(string $attribute, $quantity, $fail): void
    {
        // Extract the item index from attribute (e.g., "items.0.quantity_requested" -> 0)
        preg_match('/items\.(\d+)\.quantity_requested/', $attribute, $matches);
        if (! isset($matches[1])) {
            return;
        }

        $itemIndex = $matches[1];
        $items = $this->input('items', []);

        if (! isset($items[$itemIndex]['ppmp_item_id'])) {
            return; // Skip validation for custom items
        }

        $ppmpItemId = $items[$itemIndex]['ppmp_item_id'];
        $ppmpItem = PpmpItem::with('appItem')->find($ppmpItemId);