app/Http/Controllers/AppItemController.php

select * from `app_items` where `fiscal_year` = 2026
select count(*) as aggregate from `app_items` where `fiscal_year` = 2026
---
    public function index(Request $request): View
    {
        $fiscalYear = $request->input('fiscal_year', date('Y'));

        $categories = AppItem::getCategories($fiscalYear);

        $appItems = AppItem::active()
            ->forFiscalYear($fiscalYear)
            ->orderBy('category')
            ->orderBy('item_name')
            ->get()
            ->groupBy('category');

        $stats = [
            'total_items' => AppItem::forFiscalYear($fiscalYear)->count(),
            'active_items' => AppItem::active()->forFiscalYear($fiscalYear)->count(),
            'categories_count' => $categories->count(),
        ];