app/Http/Controllers/BacProcurementMethodController.php

select count(*) as aggregate from `purchase_requests` where `status` = 'bac_evaluation' and `procurement_method` is null
---
    public function index(Request $request): View
    {
        $requests = PurchaseRequest::with(['requester', 'department', 'items'])
            ->where('status', 'bac_evaluation')
            ->whereNull('procurement_method')
            ->latest()
            ->paginate(15);