app/Http/Controllers/BacQuotationController.php

select count(*) as aggregate from `purchase_requests` where `status` = 'bac_evaluation'
---
    public function index(Request $request): View
    {
        // Show all PRs that have been through BAC evaluation (including completed ones for reference)
        $requests = PurchaseRequest::withCount('items')
            ->with(['documents' => function ($query) {
                $query->where('document_type', 'bac_resolution')->latest();
            }])
            ->whereIn('status', [
                'bac_evaluation',
                'bac_approved',
                'partial_po_generation',
                'po_generation',
                'po_approved',
                'supplier_processing',
                'delivered',
                'completed',
            ])
            ->latest()
            ->paginate(15);