app/Http/Controllers/BudgetManagementController.php

    public function update(Request $request, Department $department)
    {
        $validated = $request->validate([
            'fiscal_year' => 'required|integer|min:2020|max:2100',
            'allocated_budget' => 'required|numeric|min:0',
            'notes' => 'nullable|string|max:1000',
        ]);

        $budget = DepartmentBudget::updateOrCreate(
            [
                'department_id' => $department->id,
                'fiscal_year' => $validated['fiscal_year'],
            ],
            [
                'allocated_budget' => $validated['allocated_budget'],
                'notes' => $validated['notes'] ?? null,
                'set_by' => Auth::id(),
            ]
        );

        return redirect()
            ->route('budget.index', ['fiscal_year' => $validated['fiscal_year']])
            ->with('success', "Budget set for {$department->name} for fiscal year {$validated['fiscal_year']}");
---
select * from `department_budgets` where (`department_id` = 9 and `fiscal_year` = '2026') limit 1