app/Http/Controllers/PpmpController.php

    public function index(): View|RedirectResponse
    {
        $user = Auth::user();

        if (!$user->department_id) {
            return redirect()->route('dashboard')
                ->withErrors(['error' => 'You must be assigned to a department to access PPMP.']);
        }

        $fiscalYear = date('Y');
        $ppmp = Ppmp::getOrCreateForDepartment($user->department_id, $fiscalYear);

        // Load items with APP item details
        $ppmp->load(['items.appItem', 'department']);
---
select * from `app_items` where `app_items`.`id` in (1, 2, 3, 4, 6, 20, 21, 22, 23, 42, 73, 143, 151, 152, 153, 154, 234)
select * from `departments` where `departments`.`id` in (1)
select * from `ppmp_items` where `ppmp_items`.`ppmp_id` in (1)

    public function create(): View|RedirectResponse
    {
        $user = Auth::user();

        if (!$user->department_id) {
            return redirect()->route('dashboard')
                ->withErrors(['error' => 'You must be assigned to a department to create PPMP.']);
        }

        $fiscalYear = date('Y');
        $ppmp = Ppmp::getOrCreateForDepartment($user->department_id, $fiscalYear);

        // Get APP items
        $categories = AppItem::getCategories($fiscalYear);
        $appItems = AppItem::active()
            ->forFiscalYear($fiscalYear)
            ->orderBy('category')
            ->orderBy('item_name')
            ->get()
            ->groupBy('category');

        // Get existing PPMP items
        $existingItems = $ppmp->items()
            ->with('appItem')
            ->get()
            ->keyBy('app_item_id');
---
select * from `app_items` where `is_active` = 1 and `fiscal_year` = 2026 order by `category` asc, `item_name` asc
select * from `app_items` where `app_items`.`id` in (1, 2, 3, 4, 6, 20, 21, 22, 23, 42, 73, 143, 151, 152, 153, 154, 234)
select * from `ppmp_items` where `ppmp_items`.`ppmp_id` = 2 and `ppmp_items`.`ppmp_id` is not null

    public function store(Request $request): RedirectResponse
    {
        $user = Auth::user();

        if (!$user->department_id) {
            return redirect()->route('dashboard')
                ->withErrors(['error' => 'You must be assigned to a department.']);
        }

        $validated = $request->validate([
            'items' => ['required', 'array', 'min:1'],
            'items.*.app_item_id' => ['required', 'exists:app_items,id'],
            'items.*.q1_quantity' => ['required', 'integer', 'min:0'],
            'items.*.q2_quantity' => ['required', 'integer', 'min:0'],
            'items.*.q3_quantity' => ['required', 'integer', 'min:0'],
            'items.*.q4_quantity' => ['required', 'integer', 'min:0'],
        ]);

        $fiscalYear = date('Y');
        $ppmp = Ppmp::getOrCreateForDepartment($user->department_id, $fiscalYear);

        DB::transaction(function () use ($ppmp, $validated) {
            // Delete existing items
            $ppmp->items()->delete();

            // Create new items
            foreach ($validated['items'] as $itemData) {
                $appItem = AppItem::findOrFail($itemData['app_item_id']);

                $totalQuantity = $itemData['q1_quantity'] +
                               $itemData['q2_quantity'] +
                               $itemData['q3_quantity'] +
                               $itemData['q4_quantity'];

                // Skip if no quantity
                if ($totalQuantity === 0) {
                    continue;
                }

                $estimatedUnitCost = $appItem->unit_price;
                $estimatedTotalCost = $totalQuantity * $estimatedUnitCost;

                PpmpItem::create([
                    'ppmp_id' => $ppmp->id,
                    'app_item_id' => $appItem->id,
                    'q1_quantity' => $itemData['q1_quantity'],
                    'q2_quantity' => $itemData['q2_quantity'],
                    'q3_quantity' => $itemData['q3_quantity'],
                    'q4_quantity' => $itemData['q4_quantity'],
                    'total_quantity' => $totalQuantity,
                    'estimated_unit_cost' => $estimatedUnitCost,
                    'estimated_total_cost' => $estimatedTotalCost,
                ]);
            }

            // Update PPMP total
            $ppmp->total_estimated_cost = $ppmp->calculateTotalCost();
            $ppmp->save();
        });
---
delete from `ppmp_items` where `ppmp_items`.`ppmp_id` = 2 and `ppmp_items`.`ppmp_id` is not null
select * from `app_items` where `app_items`.`id` = '2' limit 1
insert into `ppmp_items` (`ppmp_id`, `app_item_id`, `q1_quantity`, `q2_quantity`, `q3_quantity`, `q4_quantity`, `total_quantity`, `estimated_unit_cost`, `estimated_total_cost`, `updated_at`, `created_at`) values (2, 2, '5', '0', '5', '5', 15, '357.09', 5356.35, '2026-01-16 09:42:29', '2026-01-16 09:42:29')
update `ppmps` set `total_estimated_cost` = 69407.83, `ppmps`.`updated_at` = '2026-01-16 09:42:29' where `id` = 2

    public function summary(Ppmp $ppmp): View|RedirectResponse
    {
        $user = Auth::user();

        if ($ppmp->department_id !== $user->department_id) {
            return redirect()->route('ppmp.index')
                ->withErrors(['error' => 'You can only view your own department PPMP.']);
        }

        $ppmp->load(['items.appItem', 'department']);

        $budgetStatus = $this->budgetValidator->getBudgetStatus($ppmp);

        // Group items by category
        $itemsByCategory = $ppmp->items->groupBy(function ($item) {
            return $item->appItem->category;
        });
---
select * from `departments` where `departments`.`id` in (9)
select * from `app_items` where `app_items`.`id` in (1, 2, 3, 4, 6, 20, 21, 22, 23, 42, 73, 143, 151, 152, 153, 154, 234)
select * from `ppmp_items` where `ppmp_items`.`ppmp_id` in (2)