app/Http/Controllers/PurchaseRequestController.php

    public function index(Request $request): View
    {
        $requests = PurchaseRequest::with(['department', 'replacesPr', 'replacedByPr'])
            ->where('requester_id', Auth::id())
            ->where('is_archived', false)
            ->latest()
            ->paginate(10);

        // Get returned PRs separately
        $returnedPrs = PurchaseRequest::with('department')
            ->where('requester_id', Auth::id())
            ->where('status', 'returned_by_supply')
            ->where('is_archived', false)
            ->latest()
            ->get();
---
select * from `departments` where `departments`.`id` in (9)
select * from `purchase_requests` where `requester_id` = 20 and `is_archived` = 0 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `purchase_requests` where `requester_id` = 20 and `is_archived` = 0
select * from `purchase_requests` where `requester_id` = 20 and `status` = 'returned_by_supply' and `is_archived` = 0 order by `created_at` desc

    public function show(PurchaseRequest $purchaseRequest): View
    {
        // Ensure the PR belongs to the current user
        if ($purchaseRequest->requester_id !== Auth::id()) {
            abort(403, 'Unauthorized access to this purchase request.');
        }

        // Load relationships
        $purchaseRequest->load([
            'department',
            'requester',
            'items',
            'documents',
            'replacesPr',
            'replacedByPr',
            'returnedBy',
            'activities.user',
        ]);
---
select * from `departments` where `departments`.`id` in (9)
select * from `users` where `users`.`id` in (20)

    public function createReplacement(PurchaseRequest $originalPr): View
    {
        /** @var User|null $user */
        $user = Auth::user();
        if ($user?->isSVPRole('System Admin')) {
            abort(403, 'System Administrators are not allowed to create replacement purchase requests.');
        }

        // Ensure the PR is returned and belongs to the current user
        if ($originalPr->status !== 'returned_by_supply' || $originalPr->requester_id !== Auth::id()) {
            abort(403, 'Unauthorized to create replacement for this PR.');
        }

        // Load the original PR with items
        $originalPr->load(['items.ppmpItem', 'returnedBy']);
---
select * from `app_items` where `app_items`.`id` in (1, 2, 3, 4, 6, 20, 21, 22, 23, 42, 73, 143, 151, 152, 153, 154, 234)
select * from `ppmp_items` where `ppmp_items`.`ppmp_id` in (2)

        ];

        // Group PPMP items by APP item category and add quarter status
        $ppmpItems = $ppmp->items
            ->filter(function ($item) {
                return $item->appItem !== null;
            })
            ->groupBy(function ($item) {
                return $item->appItem->category;
            });
---
select * from `app_items` where `app_items`.`id` in (2)