app/Http/Controllers/PurchaseRequestController.php

                $itemCategory = null;
                if (!empty($itemData['ppmp_item_id'])) {
                    // Get PPMP item to extract category
                    $ppmpItem = PpmpItem::find($itemData['ppmp_item_id']);
---
select * from `ppmp_items` where `ppmp_items`.`id` in (1, 5, 6, 7, 8, 11)