app/Http/Controllers/SupplyPurchaseRequestController.php

select * from `departments` where `departments`.`id` in (9)
select * from `ppmp_items` where `ppmp_items`.`id` in (1, 5, 6, 7, 8, 11)
select * from `users` where `users`.`id` in (20)
---
    public function show(PurchaseRequest $purchaseRequest): View
    {
        $purchaseRequest->load([
            'requester',
            'department',
            'items.ppmpItem',
            'returnedBy',
            'replacesPr.requester',
            'replacedByPr',
            'activities.user',
            'documents',
            'itemGroups.aoqGeneration',
            'itemGroups.quotations.supplier',
            'itemGroups.purchaseOrders',
            'itemGroups.items',
        ]);