app/Models/AppItem.php

select distinct `category` from `app_items` where `is_active` = 1 and `fiscal_year` = 2026 order by `category` asc
---
    public static function getCategories(?int $fiscalYear = null): \Illuminate\Support\Collection
    {
        $query = static::active();

        if ($fiscalYear) {
            $query->forFiscalYear($fiscalYear);
        }

        return $query
            ->select('category')
            ->distinct()
            ->orderBy('category')
            ->pluck('category');