app/Models/DepartmentBudget.php

    public static function getOrCreateForDepartment(int $departmentId, int $fiscalYear): self
    {
        return static::firstOrCreate(
            [
                'department_id' => $departmentId,
                'fiscal_year' => $fiscalYear,
            ],
            [
                'allocated_budget' => 0,
                'utilized_budget' => 0,
                'reserved_budget' => 0,
            ]
        );
---
insert into `department_budgets` (`department_id`, `fiscal_year`, `allocated_budget`, `utilized_budget`, `reserved_budget`, `updated_at`, `created_at`) values (1, 2026, 0, 0, 0, '2026-01-16 08:53:46', '2026-01-16 08:53:46')
select * from `department_budgets` where (`department_id` = 9 and `fiscal_year` = 2026) limit 1