app/Models/Ppmp.php

select sum(`estimated_total_cost`) as aggregate from `ppmp_items` where `ppmp_items`.`ppmp_id` = 2 and `ppmp_items`.`ppmp_id` is not null
---
    public function calculateTotalCost(): float
    {
        return (float) $this->items()
            ->sum('estimated_total_cost');

update `ppmps` set `status` = 'validated', `validated_at` = '2026-01-16 09:43:15', `validated_by` = 20, `ppmps`.`updated_at` = '2026-01-16 09:43:15' where `id` = 2
---
    public function validate(int $userId): bool
    {
        if (!$this->isWithinBudget()) {
            return false;
        }

        $this->status = 'validated';
        $this->validated_at = now();
        $this->validated_by = $userId;

        return $this->save();

insert into `ppmps` (`department_id`, `fiscal_year`, `status`, `total_estimated_cost`, `updated_at`, `created_at`) values (1, 2026, 'draft', 0, '2026-01-16 08:53:46', '2026-01-16 08:53:46')
select * from `ppmps` where (`department_id` = 9 and `fiscal_year` = 2026) limit 1
---
    public static function getOrCreateForDepartment(int $departmentId, int $fiscalYear): self
    {
        return static::firstOrCreate(
            [
                'department_id' => $departmentId,
                'fiscal_year' => $fiscalYear,
            ],
            [
                'status' => 'draft',
                'total_estimated_cost' => 0,
            ]
        );