app/Models/PurchaseRequest.php

select `pr_number` from `purchase_requests` where `pr_number` like 'PR-0126-%' order by `pr_number` desc limit 1
---
    public static function generateNextPrNumber(?Carbon $asOf = null): string
    {
        $asOf = $asOf ?: now();
        $monthYear = $asOf->format('my'); // MMYY format
        $prefix = 'PR-'.$monthYear.'-';
        $last = static::where('pr_number', 'like', $prefix.'%')
            ->orderByDesc('pr_number')
            ->value('pr_number');